# **Getting Started with PANDAS....**

In [2]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {"name":["harry","rohan","ram"],
         "marks":[67,87,98],
         "city":["rampur","delhi","lmp"]
}

In [3]:
datF = pd.DataFrame(dict1)
datF

    name  marks    city
0  harry     67  rampur
1  rohan     87   delhi
2    ram     98     lmp

In [4]:
datF.to_csv("TestFriends.csv")

In [5]:
datF.to_csv("TestFriends_index.csv",index=False)

In [6]:
datF.head(2)

    name  marks    city
0  harry     67  rampur
1  rohan     87   delhi

In [7]:
datF.tail(2)

    name  marks   city
1  rohan     87  delhi
2    ram     98    lmp

In [8]:
datF.describe()

           marks
count   3.000000
mean   84.000000
std    15.716234
min    67.000000
25%    77.000000
50%    87.000000
75%    92.500000
max    98.000000

In [9]:
hridu = pd.read_csv("stocks.csv")
hridu

    Company Name  Price  Earnings Per Share   Book Value
0       Reliance   1467                  66          653
1     Tata Steel    391                  89          572
2        Infosys    650                  35          147
3      Axis Bank    739                  19          263
4  Bajaj Finance   4044                  69          341

In [10]:
hridu["Price"][1] = 400
hridu

C:\Users\hrida\AppData\Local\Temp\ipykernel_14888\3939612007.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  hridu["Price"][1] = 400

    Company Name  Price  Earnings Per Share   Book Value
0       Reliance   1467                  66          653
1     Tata Steel    400                  89          572
2        Infosys    650                  35          147
3      Axis Bank    739                  19          263
4  Bajaj Finance   4044                  69          341

In [11]:
hridu.to_csv("hridu.csv", index=False)

In [3]:
ser =  pd.Series(np.random.rand(54))

In [4]:
type(ser)

pandas.core.series.Series

In [5]:
ser

0     0.111374
1     0.702315
2     0.122127
3     0.886872
4     0.118732
5     0.172593
6     0.061606
7     0.029574
8     0.273373
9     0.424831
10    0.254505
11    0.227965
12    0.551578
13    0.689187
14    0.629674
15    0.689151
16    0.166669
17    0.537198
18    0.343787
19    0.554489
20    0.921977
21    0.816189
22    0.110520
23    0.169565
24    0.324331
25    0.666201
26    0.467200
27    0.880261
28    0.423917
29    0.549840
30    0.701609
31    0.277009
32    0.835040
33    0.263221
34    0.754921
35    0.038509
36    0.251917
37    0.043224
38    0.059748
39    0.767837
40    0.484758
41    0.337582
42    0.984152
43    0.421654
44    0.010333
45    0.254403
46    0.692291
47    0.591232
48    0.220858
49    0.026502
50    0.844998
51    0.167755
52    0.936179
53    0.094729
dtype: float64

In [6]:
newDF = pd.DataFrame(np.random.rand(132,12), index = np.arange(132))
newDF

,0,1,2,3,4,5,6,7,8,9,10,11
0,0.594960,0.048703,0.953112,0.879573,0.915297,0.754928,0.901319,0.139075,0.389448,0.452869,0.937644,0.558425
1,0.356259,0.333032,0.234509,0.513488,0.926188,0.172154,0.174238,0.398030,0.927767,0.558783,0.023296,0.291133
2,0.644510,0.337501,0.776262,0.685771,0.418553,0.408961,0.660982,0.530736,0.642789,0.809713,0.833067,0.968114
3,0.611842,0.969139,0.927870,0.244427,0.905711,0.214064,0.705487,0.557722,0.962498,0.704442,0.989729,0.402346
4,0.946136,0.044925,0.800564,0.352693,0.730568,0.067342,0.326392,0.894993,0.659872,0.648955,0.078411,0.697765
...,...,...,...,...,...,...,...,...,...,...,...,...
127,0.763543,0.777010,0.033695,0.705390,0.519993,0.401537,0.176377,0.395979,0.221874,0.489581,0.990054,0.484997
128,0.476635,0.313792,0.470878,0.619715,0.370341,0.092817,0.868683,0.732234,0.472780,0.731542,0.329342,0.609318
129,0.307943,0.244282,0.548043,0.297518,0.183285,0.904120,0.383158,0.305767,0.683411,0.455567,0.735575,0.383630
130,0.426839,0.814480,0.224246,0.885171,0.340211,0.795661,0.105491,0.687173,0.681901,0.930656,0.803249,0.537050
131,0.831994,0.332482,0.118802,0.011022,0.655954,0.705358,0.548849,0.386166,0.260316,0.343258,0.130049,0.913691

In [7]:
newDF.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,0.594960,0.048703,0.953112,0.879573,0.915297,0.754928,0.901319,0.139075,0.389448,0.452869,0.937644,0.558425
1,0.356259,0.333032,0.234509,0.513488,0.926188,0.172154,0.174238,0.398030,0.927767,0.558783,0.023296,0.291133
2,0.644510,0.337501,0.776262,0.685771,0.418553,0.408961,0.660982,0.530736,0.642789,0.809713,0.833067,0.968114
3,0.611842,0.969139,0.927870,0.244427,0.905711,0.214064,0.705487,0.557722,0.962498,0.704442,0.989729,0.402346
4,0.946136,0.044925,0.800564,0.352693,0.730568,0.067342,0.326392,0.894993,0.659872,0.648955,0.078411,0.697765

In [8]:
newDF.tail()

,0,1,2,3,4,5,6,7,8,9,10,11
127,0.763543,0.777010,0.033695,0.705390,0.519993,0.401537,0.176377,0.395979,0.221874,0.489581,0.990054,0.484997
128,0.476635,0.313792,0.470878,0.619715,0.370341,0.092817,0.868683,0.732234,0.472780,0.731542,0.329342,0.609318
129,0.307943,0.244282,0.548043,0.297518,0.183285,0.904120,0.383158,0.305767,0.683411,0.455567,0.735575,0.383630
130,0.426839,0.814480,0.224246,0.885171,0.340211,0.795661,0.105491,0.687173,0.681901,0.930656,0.803249,0.537050
131,0.831994,0.332482,0.118802,0.011022,0.655954,0.705358,0.548849,0.386166,0.260316,0.343258,0.130049,0.913691

In [9]:
newDF.dtypes

0     float64
1     float64
2     float64
3     float64
4     float64
5     float64
6     float64
7     float64
8     float64
9     float64
10    float64
11    float64
dtype: object

In [10]:
newDF[0][0] = "Harry"
newDF.dtypes

C:\Users\hrida\AppData\Local\Temp\ipykernel_16296\344599495.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value 'Harry' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newDF[0][0] = "Harry"

0      object
1     float64
2     float64
3     float64
4     float64
5     float64
6     float64
7     float64
8     float64
9     float64
10    float64
11    float64
dtype: object

In [11]:
newDF.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       122, 123, 124, 125, 126, 127, 128, 129, 130, 131],
      dtype='int32', length=132)

In [12]:
newDF.columns

RangeIndex(start=0, stop=12, step=1)

In [13]:
newDF.to_numpy()

array([['Harry', 0.048703350538061074, 0.9531115630570514, ...,
        0.4528688711894061, 0.9376443022605756, 0.5584248833440234],
       [0.3562590401897954, 0.3330324565036229, 0.23450934083650432, ...,
        0.5587825148087148, 0.02329584871394852, 0.2911325498013414],
       [0.6445099962216863, 0.33750095743335595, 0.7762615670898175, ...,
        0.8097129443491974, 0.8330667617517532, 0.9681138905353299],
       ...,
       [0.3079427263241066, 0.24428180657889753, 0.5480431263739249, ...,
        0.45556741716881755, 0.7355749063468945, 0.38363044606218666],
       [0.4268387968857268, 0.8144798207617435, 0.2242461711360424, ...,
        0.9306562646333909, 0.8032486559844584, 0.5370497128889802],
       [0.8319940289682248, 0.3324819694628921, 0.1188023228609576, ...,
        0.3432576521863425, 0.13004915009868823, 0.9136914630878811]],
      dtype=object)